os/semaphores.html
---
layout: page
title: Semaphoren
---

<p>
Ein <b>Semaphor</b> (auch <i>Counting Semaphore</i> oder <i>General Semaphore</i>)
besteht aus
</p>

<ul class="org-ul">
<li>einem Integer Wert und
</li>
<li>einer Queue mit wartenden (blockierten) Prozessen/Threads
</li>
</ul>

<p>
Ein Semaphor stellt zwei <a href="./atomic_operations.html">atomare
Operationen</a> zur Verfügung:
</p>

<ul class="org-ul">
<li><code>wait(⟨semaphore⟩)</code> bzw. <code>p(⟨semaphore⟩)</code>:
<ul class="org-ul">
<li>Wert dekrementieren
</li>
<li>ggf. aufrufenden Prozess blockieren und hinten in die Queue einreihen (wenn
Wert der Semaphre &lt; 0 ist)
</li>
</ul>
</li>
<li><code>signal(⟨semaphore⟩)</code> bzw. <code>v(⟨semaphore⟩)</code>:
<ul class="org-ul">
<li>Wert inkrementieren und
</li>
<li>ggf. den ersten wartenden Prozess aus der Queue in den Ready
Zustand versetzen (wenn der Wert der Semaphore &lt;= 0 ist) und den
Prozess aus der Queue entfernen
</li>
</ul>
</li>
</ul>

<pre class="example">
wait() {
  s.value--;
  if(s.value &lt; 0) {
    tail(s.queue) = p;
    block(p);
}
</pre>

<pre class="example">
signal() {
  s.value++;
  if(s.value &lt;= 0) {
    ready(head(s.queue));
    deletehead(s.queue);
}
</pre>

<pre class="example">
wait(⟨semaphore⟩);
⟨Critical Section⟩
signal(⟨semaphore⟩);
</pre>

<div id="outline-container-sec-0-1" class="outline-3">
<h3 id="sec-0-1"><span class="section-number-3">0.1</span> Nachteile von Semaphoren</h3>
<div class="outline-text-3" id="text-0-1">
<ul class="org-ul">
<li><code>p()</code> und <code>v()</code> müssen explizit aufgerufen werden. Wenn ein Aufruf
vergessen wird können Fehler auftreten.
</li>
<li>kein <b>reentry</b>: Man muss immer sicherstellen, dass zur Laufzeit
nicht zweimal hintereinander (z.B. in unterschiedlichen Methoden)
<code>p()</code> aufgerufen wird
</li>
<li>syntaktisch unschön: atomare Blöcke im Code schwer zu
identifizieren; der code wird schnell unübersichtlich
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Binäre Semaphoren</h2>
<div class="outline-text-2" id="text-1">
<p>
Eine <b>binäre Semaphore</b> (engl. <i>binary semaphore</i>) kann nur die Werte
<code>0</code> und <code>1</code> annehmen. Eine binärere Semaphore wird häufig auch als
<i>Mutex</i> (kurz für mutual exclusion) bezeichnet, da damit
wechselseitger Ausschluss von Prozessen beim Zugriff auf Ressourcen
realisierbar ist.
</p>
</div>
</div>
